Цель урока:

1. Изучить HTTP-сервисы
2. Изучить ожидаемые и неожидаемые ошибки HTTP
3. Разобрать, какие есть методы для логирования неожидаемых ошибок
4. Изучить методы работы с данными на сервере
5. Изучить паттерн переиспользуемого HTTP-сервиса и паттрен реализация API через service
6. Изучить кастомные хуки

Содержание урока:

1. HTTP-клиенты
2. GET, POST, UPDATE, DELETE Data
3. Обработка ошибок
4. Паттерн “Reusable HTTP Service”
5. Паттерн “Reusable logget”
6. Отображение оповещений для пользователя
7. Кастомные хуки
8. Контекст

Для работы с MongoDB используйте VPN

https://1.1.1.1/

https://1.1.1.1/


// В данной статье мы научимся работать с HTTP-запросами, узнаем, 
// какие виды запросов есть, разберёмся со способами работы с HTTP-запросами. 

// Структура и примеры конспекта будут отличаться от структуры видеоуроков. 
// Вначале в качестве вспомогательного материала будет текстовое описание 
// установки и запуска MongoDB. 

