// Чтобы установить MongoDB на Windows, 
// нужно скачать MongoDB Community Server 
// по ссылке. https://www.mongodb.com/try/download/community?tck=docs_server
// Выбираем текущую версию, операционную систему Windows 
// и нажимаем на кнопку “Download”:

//После загрузки запускаем установщик, выбираем “Complete”:

// В следующем окне выбираем опции, как показано на скрине (настройки по умолчанию):

// Далее НЕ снимаем галочку с Install MongoDB Compass (это визуальный интерфейс для работы с Mongo):

// Далее нажимаем “Next” и дожидаемся конца установки. 

// После этого откроется MongoDB Compass.
// В появившемся окне ничего не отключаем, оставляем как есть:

// И далее тоже ничего не меняем и нажимаем “Connect”:

// Мы подключились к локальной базе данных: