https://create-react-app.dev/
// Create React App – официальный инструмент для создания single-page React приложений. 
// Он предоставляет готовую, актуальную сборку проекта (со всеми нужными зависимостями 
//     и конфигурацией Webpack). Чтобы создать новый проект, необходимо выполнить команду:

// npx create-react-app my-app

// Примечание: для работы необходимо установить Node.js, рекомендуем версию LTS: ссылка
https://nodejs.org/en/

// Подробнее об инструменте npx: ссылка
https://medium.com/@maybekatz/introducing-npx-an-npm-package-runner-55f7d4bd282b

// После того, как проект сгенерирован, создастся папка my-app и в ней будет весь код приложения. 
// Её необходимо открыть в редакторе кода.

// Для запуска приложения нужно выполнить команду:

// npm start