// Для того чтобы понять, какие у нас есть данные, 
// ранее мы выводили их в console.log(), и многие так и делают, 
// но есть более удобные инструменты для отладки React-приложений.


// Установи расширение в браузер React Developer Tools. 
// Когда ты установишь это расширение, то в инструментах разработчика 
// браузера появятся две вкладки Components и Profiler.


// Чтобы видеть все компоненты, удали фильтр и установи флаг 
// ”expand component tree by default”.

// Теперь, выбрав компонент из списка, ты увидишь его props и state. 
// Это упростит тебе в дальнейшем отладку своего приложения.