// Цель урока:

// 1. Понять, из чего состоит Backend
// 2. Научиться настраивать базу данных MongoDB
// 3. Научиться работать с полезными npm пакетами (cross-env, config и другие)
// 4. Научиться создавать модели mongo и добавлять тестовые данные в базу данных
// 5. Установить Postman и научиться отправлять простые запросы


// Содержание урока:

// 1. Настройка окружения
// 2. Настройка сервера
// 3. Создание базы данных
// 4. Подключение к базе данных
// 5. Добавление первоначальных данных 
// 6. Создание моделей
// 7. Создание первоначальной структуры роутов
// 8. Получение профессий и качеств через GET запрос
// 9. Базовая работа с Postman