// Настройка сервера:
// 1. Создай в своем дипломном проекте папку ”server” и “client”
// 2. Перенеси фронтенд в папку “client”
// 3. Проинициализируй package.json в папке “server”
// 4. Добавь необходимые зависимости (express, mongoose, chalk, config)
// 5. В папке “server” создай файл app.js и в нем подключи express (как в уроке)

// Настройка рабочего окружения:
// 1. Добавь пакеты nodemon и cross-env в серверную часть вашего дипломного проекта
// 2. Добавь npm-скрипты start и serve в проект

// Добавляем middleware для приложения:
// 1. Добавь middleware express.json() и express.urlencoded() в свой дипломный проект

// Настраиваем MongoDB:
// 2. Настрой mongoose в своем дипломном проекте

// Подключаем MongoDB:
// 1. Создай облачную базу данных MongoDB Atlas Cloud Database либо создай локальную базу данных на своем компьютере
// 2. Подключись к базе данных при помощи mongoose в своем дипломном проекте

// Заносим первоначальные данные:
// 1. Занеси первоначальные данные своего дипломного проекта в базу данных

// Создаем модели:
// 1. Создай все необходимые модели своего дипломного проекта

// 1. Создаем структуру роутов:
// Создай всю необходимую структуру для роутов своего дипломного проекта

// Получаем Профессии и Качества:
// 1 В твоем дипломном проекте реализуй функционал для получения 
// необходимых сущностей с сервера через GET- запрос

// Что такое Postman:
// 1. Установи Postman
// 2. Протестируй отправку запросов на сервер своего дипломного проекта