//1. Функциональные декларации (Function Declarations):
// Это наиболее распространенный способ объявления функций
// с использованием ключевого слова function.
function myFunction() {
  // Тело функции
}

//2. Функциональные выражения (Function Expressions):
// Функции могут быть также созданы как часть выражений, например,
// при присваивании переменной или в качестве аргумента другой функции.
// Это может включать именованные функциональные выражения и анонимные
// функциональные выражения.
const myFunction = function () {
  // Тело функции
}

// Или стрелочные функции
const arrowFunction = () => {
  // Тело функции
}
