// 1. JavaScript является встраиваемым языком скриптов, что означает,
// что он не существует сам по себе, а должен быть встроен в какую-то среду.

//  Обычно JavaScript встроен либо в браузер, либо в среду выполнения, такую как Node.js или D8.

//  В связи с этим можно сделать следующий вывод: в JavaScript существует набор функций,
//  определённых спецификацией языка (ECMAScript), а также сторонние API, предоставляемые окружением,
//  которые позволяют JavaScript взаимодействовать с внешними ресурсами
//  и выполнять задачи, не определённые в самой спецификации языка.
