Цель урока:

// 1. Изучить хуки useRef(), useMemo(), useCallback()
// 2. Понять, что такое компоненты высшего порядка (Higher-Order Components, HOC)
// 3. Понять, зачем нужен React.memo() (компонент высшего порядка) и чем он отличается от useMemo()
// 4. Изучить React.cloneElement() и React.Children
// 5. Закрепить полученные знания на создании универсального компонента формы

Содержание урока:

// 1. Хуки useRef(), useMemo(), useCallback(), их особенности и способы применения
// 2. HOC (компоненты высшего порядка) - что это такое и чем могут быть полезны
// 2. React.memo() (компонент высшего порядка) - повышение производительности
// 4. React.cloneElement(), React.Children - особенности и способы применения
// 5. Разработка переиспользуемого компонента формы
// 6. Автоматическая установка фокуса на поле ввода при открытии страницы
// 7. Переключение полей для ввода при нажатии на Enter