// ссылка на статью https://habr.com/ru/companies/otus/articles/515078/

// Непрерывная интеграция (Continuous Integration, CI) и непрерывная поставка (Continuous Delivery, CD) представляют собой культуру,
// набор принципов и практик, которые позволяют разработчикам чаще и надежнее развертывать изменения программного обеспечения.

// CI
// Непрерывная интеграция — это методология разработки и набор практик,
// при которых в код вносятся небольшие изменения с частыми коммитами.
// И поскольку большинство современных приложений разрабатываются
// с использованием различных платформ и инструментов, то появляется
// необходимость в механизме интеграции и тестировании вносимых изменений.

// Цель CI — обеспечить последовательный и автоматизированный способ сборки,
// упаковки и тестирования приложений.

// Цель CD - Автоматизировать развертывание приложения в различных окружения
